library random_food.globals;

// 글로벌 변수
List kor = ['곱창', '치킨', '라면'];
List eu = ['곱창', '치킨', '라면'];
List brunch = ['곱창', '치킨', '라면'];
List chn = ['곱창', '치킨', '라면'];
List jpn = ['곱창', '치킨', '라면'];
List asia = ['곱창', '치킨', '라면'];
List noodle = ['곱창', '치킨', '라면'];
List rice = ['곱창', '치킨', '라면'];
List meat = ['곱창', '치킨', '라면'];
List light = ['곱창', '치킨', '라면'];
List glutenFree = ['곱창', '치킨', '라면'];

List total = [];

Map<String, List> mapItem = {
  '전체': total,
  "중국": chn,
  "한국": kor,
  "일본": jpn,
  "동남아": asia,
  "유럽": eu,
  "브런치": brunch,
};

Map mapImage = {
  '치킨': 0,
  '라면': 1,
  '곱창': 2,파스타
  '떡볶이': 3,
  '국밥': 4,
  '만두': 5,
  '연어': 6,
  '삼겹살': 7,
  '스테이크': 8,
  '칼국수': 9,
  '족발': 10,
  '타코': 11,
  '라멘': 12,
  '피자': 13,
  '돈까스': 14,
  '회': 15,
  '마라탕': 16,
  '초밥': 17,
  '파스타': 18,
  '리조또': 19,
  '샤브샤브': 20,
  '닭갈비': 21,
  '찜닭': 22,
  '짬뽕': 23,
  '양꼬치': 24,
  '쌀국수': 25,
  '전': 26,
  '찌개': 27,
  '매운탕': 28,
  '팟타이': 29,
  '볶음밥': 30,
  '샐러드': 31,
  '김밥': 32,
  '덮밥': 33,
  '비빔밥': 34,
  '갈비': 35,
  '탕': 36,
  '딤섬': 37,
  '우동': 38,
  '소바': 39,
  '보쌈': 40,
  '수육': 41,
  '부리또': 42,
  '버거': 43,
  '짜장면': 44,
  '도시락': 45,
  '닭발': 46,
  '샌드위치': 47,
  '육회': 48,
  '조개구이': 49,
  '오코노미야키': 50,
  '카레': 51,
  '수프': 52,
  '팬케이크': 53,
  '포케': 54,
  '죽': 55,
  '구운 계란': 56,
  '타코야키': 57,
  '고구마': 58,
  '옥수수': 59,
  '쭈꾸미볶음': 60,
};
